//IBMUSERA JOB ,'ASM',CLASS=A,MSGCLASS=X,
//         MSGLEVEL=(1,1),NOTIFY=&SYSUID
//         JCLLIB ORDER=(&SYSUID..DEV.PROCLIB)
//         SET PROG=HELLO
//ASSEM    EXEC ASMBIND
