//IBMUSERH JOB ,'HELLO',CLASS=A,MSGCLASS=X,
//         MSGLEVEL=(1,1),NOTIFY=&SYSUID
//*
//STEP1    EXEC PGM=HELLO
//STEPLIB  DD  DSN=&SYSUID..DEV.PROGLIB,DISP=SHR
//SYSOUT   DD  SYSOUT=*
//SYSPRINT DD  SYSOUT=*
